package weather
import (
	"testing"
	"net/http"
	"io/ioutil"
	"encoding/json"
)


//http://ip.taobao.com/service/getIpInfo.php?ip=119.137.58.164
func TestProtoFriendListData(t *testing.T) {

//	t.Log(IP2City("http://ip.taobao.com/service/getIpInfo.php?ip=119.137.58.164"))


//	ip:= "220.173.122.113" //广西壮族自治区
//		ip:= "119.137.58.164" //深圳
	ip:= "61.128.126.23" //新疆维吾尔自治区

	resp, _ := http.Get("http://ip.taobao.com/service/getIpInfo.php?ip=" + ip)


	defer resp.Body.Close()
	content, _ := ioutil.ReadAll(resp.Body)
//		t.Log(string(content))

	m := &jsonVO{}

	err:=json.Unmarshal(content, m)
	if err != nil{
		t.Log("ip 地址无法解析")
	}
//	t.Log("Area: ",m.Data.Area)
//	t.Log("City: ",m.Data.City)
//	t.Log("Country: ",m.Data.Country)
//	t.Log("County: ", m.Data.County)
//	t.Log("Region: ",m.Data.Region)
//	t.Log("Isp: ",m.Data.Isp)

	var cityId = ""
	if m.Data.Region != ""{
		if region,ok:= CityHash[m.Data.Region];ok{
			if city,ok:= region[m.Data.City];ok{
				cityId = city
			}
		}
	}


	if cityId != ""{
		weatherURL:="http://weather.gtimg.cn/city/" + cityId + ".js"
		resp, _ = http.Get(weatherURL)

		defer resp.Body.Close()
		content, _ = ioutil.ReadAll(resp.Body)

//		content:= `{"bi_name": "深圳", "zs_xc": "4", "h3": {"rt": "2015-9-2 8:00:00", "0":
//[{"wd": "0", "ts": "2015-9-2 11:00:00", "tp": "30", "wkd": "3", "wt": "03", "wp": "0", "te": "2015-9-2 14:00:00"}, {"wd": "0", "ts": "2015-9-2 14:00:00", "tp": "29", "wkd": "3", "wt": "03", "wp": "0", "te": "2015-9-2 17:00:00"}, {"wd": "0", "ts": "2015-9-2 17:00:00", "tp": "27", "wkd": "3", "wt": "03", "wp": "0", "te": "2015-9-2 20:00:00"}, {"wd": "0", "ts": "2015-9-2 20:00:00", "tp": "27", "wkd": "3", "wt": "03", "wp": "0", "te": "2015-9-2 23:00:00"}, {"wd": "0", "ts": "2015-9-2 23:00:00", "tp": "27", "wkd": "3", "wt": "03", "wp": "0", "te": "2015-9-3 2:00:00"}, {"wd": "0", "ts": "2015-9-3 2:00:00", "tp": "26", "wkd": "4", "wt": "03", "wp": "0", "te": "2015-9-3 5:00:00"}, {"wd": "0", "ts": "2015-9-3 5:00:00", "tp": "25", "wkd": "4", "wt": "03", "wp": "0", "te": "2015-9-3 8:00:00"}, {"wd": "0", "ts": "2015-9-3 8:00:00", "tp": "27", "wkd": "4", "wt": "03", "wp": "0", "te": "2015-9-3 11:00:00"}, {"wd": "0", "ts": "2015-9-3 11:00:00", "tp": "32", "wkd": "4", "wt": "03", "wp": "0", "te": "2015-9-3 14:00:00"}, {"wd": "0", "ts": "2015-9-3 14:00:00", "tp": "31", "wkd": "4", "wt": "03", "wp": "0", "te": "2015-9-3 17:00:00"}, {"wd": "0", "ts": "2015-9-3 17:00:00", "tp": "31", "wkd": "4", "wt": "03", "wp": "0", "te": "2015-9-3 20:00:00"}, {"wd": "0", "ts": "2015-9-3 20:00:00", "tp": "28", "wkd": "4", "wt": "03", "wp": "0", "te": "2015-9-3 23:00:00"}, {"wd": "0", "ts": "2015-9-3 23:00:00", "tp": "28", "wkd": "4", "wt": "03", "wp": "0", "te": "2015-9-4 2:00:00"}, {"wd": "0", "ts": "2015-9-4 2:00:00", "tp": "26", "wkd": "5", "wt": "03", "wp": "0", "te": "2015-9-4 5:00:00"}, {"wd": "0", "ts": "2015-9-4 5:00:00", "tp": "27", "wkd": "5", "wt": "03", "wp": "0", "te": "2015-9-4 8:00:00"}, {"wd": "0", "ts": "2015-9-4 8:00:00", "tp": "29", "wkd": "5", "wt": "03", "wp": "0", "te": "2015-9-4 11:00:00"}]
//},
// "wk": {"rt": "2015-9-2 8:00:00", "0":
//[{"wd": "0", "ts": "2015-9-2 11:00:00", "tp": "30", "wkd": "3", "wt": "03", "wp": "0", "te": "2015-9-2 14:00:00"}, {"wd": "0", "ts": "2015-9-2 14:00:00", "tp": "29", "wkd": "3", "wt": "03", "wp": "0", "te": "2015-9-2 17:00:00"}, {"wd": "0", "ts": "2015-9-2 17:00:00", "tp": "27", "wkd": "3", "wt": "03", "wp": "0", "te": "2015-9-2 20:00:00"}, {"wd": "0", "ts": "2015-9-2 20:00:00", "tp": "27", "wkd": "3", "wt": "03", "wp": "0", "te": "2015-9-2 23:00:00"}, {"wd": "0", "ts": "2015-9-2 23:00:00", "tp": "27", "wkd": "3", "wt": "03", "wp": "0", "te": "2015-9-3 2:00:00"}, {"wd": "0", "ts": "2015-9-3 2:00:00", "tp": "26", "wkd": "4", "wt": "03", "wp": "0", "te": "2015-9-3 5:00:00"}, {"wd": "0", "ts": "2015-9-3 5:00:00", "tp": "25", "wkd": "4", "wt": "03", "wp": "0", "te": "2015-9-3 8:00:00"}, {"wd": "0", "ts": "2015-9-3 8:00:00", "tp": "27", "wkd": "4", "wt": "03", "wp": "0", "te": "2015-9-3 11:00:00"}, {"wd": "0", "ts": "2015-9-3 11:00:00", "tp": "32", "wkd": "4", "wt": "03", "wp": "0", "te": "2015-9-3 14:00:00"}, {"wd": "0", "ts": "2015-9-3 14:00:00", "tp": "31", "wkd": "4", "wt": "03", "wp": "0", "te": "2015-9-3 17:00:00"}, {"wd": "0", "ts": "2015-9-3 17:00:00", "tp": "31", "wkd": "4", "wt": "03", "wp": "0", "te": "2015-9-3 20:00:00"}, {"wd": "0", "ts": "2015-9-3 20:00:00", "tp": "28", "wkd": "4", "wt": "03", "wp": "0", "te": "2015-9-3 23:00:00"}, {"wd": "0", "ts": "2015-9-3 23:00:00", "tp": "28", "wkd": "4", "wt": "03", "wp": "0", "te": "2015-9-4 2:00:00"}, {"wd": "0", "ts": "2015-9-4 2:00:00", "tp": "26", "wkd": "5", "wt": "03", "wp": "0", "te": "2015-9-4 5:00:00"}, {"wd": "0", "ts": "2015-9-4 5:00:00", "tp": "27", "wkd": "5", "wt": "03", "wp": "0", "te": "2015-9-4 8:00:00"}, {"wd": "0", "ts": "2015-9-4 8:00:00", "tp": "29", "wkd": "5", "wt": "03", "wp": "0", "te": "2015-9-4 11:00:00"}]
//}, "zs_yh": "4", "zs_zwx": "2", "sk_hd": "NULL", "zs_ys": "2", "zs_fh": "8", "bi_sr": "05:34", "bi_ss": "18:12", "bi_lat": "25.040", "zs_ly": "3", "zs_te": "2015-9-3 8:00:00", "sk_wd": "NULL", "bi_long": "121.516", "zs_ffz": "3", "zs_ls": "5", "zs_jt": "3", "zs_hz": "3", "sk_wp": "NULL", "zs_ts": "2015-9-2 8:00:00", "zs_ssd": "2", "sk_wt": "NULL", "zs_hc": "3"
//}`
//		constr:= string(content)
//		constr = strings.Replace(constr,"var __weather_city = ","",len(constr))


		h3:= H3VO{}
		content = content[20:len(content)-1]
		err:=json.Unmarshal(content, &h3)
		if err != nil{
			t.Log("ip 地址无法解析")
		}

		t.Log(h3.H3.VO[0].Tp,h3.H3.VO[0].Wt,WeatherHash[h3.H3.VO[0].Wt])
	}
}

